## Library

In [1]:
import pandas as pd
import json
import re

## Operation

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [3]:
patten = '^s|^S'
def rutvik(num):
    match = re.search(patten,num)
    if bool(match):
        return True
    else:
        return False

# Home work

In [4]:
# Q1. How many male and female is onborded
male_count = sum(df['Sex']=='male')
female_count = sum(df['Sex']=='female')
print(f"The male count is {male_count} and female count is {female_count}")

The male count is 577 and female count is 314

In [5]:
# Q2.,Q3 survive and casuality count
survive = sum(df['Survived']==1)
casualty = sum(df['Survived']==0)
print(f"The count of survive is {survive},and casualty happend is {casualty}")

The count of survive is 342,and casualty happend is 549

In [6]:
df[df['Age']==max(df['Age'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [7]:
#Q4.  Name of person who is eldest one
name = df[df['Age']==max(df['Age'])]
# name = " ".join(str(name['Name']).split(' ')[4:-3])
name_of_person = name['Name'][630]
print(f"The name of person who has oldest one is : {name_of_person}")

The name of person who has oldest one is : Barkworth, Mr. Algernon Henry Wilson

In [8]:
#Q5. how many passenger do we have in first , second and third class 
first_class = len(df.groupby('Pclass').get_group(1))
second_class= len(df.groupby('Pclass').get_group(2))
third_class = len(df.groupby('Pclass').get_group(3))
print(f"Total number of people travel in first class is :  {first_class} , second class = {second_class} and third class is {third_class}")

Total number of people travel in first class is :  216 , second class = 184 and third class is 491

In [9]:
# Q6 how many person we have whose name starts with "s"
s_name = len(df[df['Name'].map(rutvik)])
print(f"The total number of people whose name start with s is {s_name}")

The total number of people whose name start with s is 86

In [10]:
# Q7  try to create a new column which is a summation  of "SibSp" and "parch"
df['new_part'] = df['SibSp'] + df['Parch']
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_part
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1

In [20]:
#Q8 count of people whose age is less than 25

count_age25 = len(df[df['Age']<25])

print(f"Their are {count_age25} people those age is less than 25")

Their are 278 people those age is less than 25

In [22]:
#Q9 count of people whose age is less than 40

count_age40 = len(df[df['Age']<40])

print(f"Their are {count_age40} people those age is less than 40")

Their are 551 people those age is less than 40

In [37]:
'2'.isnumeric()

True

In [90]:
def divide_str(string):
    char = ''
    num = ''
    try:
        for word in string[0]:
            if word.isnumeric():
                num+=word
            else:
                char+=word
        return char + ' '+ num
    except:
        return string
    
import string
# df['Name'] = df['Name'].str.rstrip(string.digits)

In [94]:
"""
From a cabin columns separate text and numeric value
"""
# df['Cabin'] = df['Cabin'].fillna(method = 'bfill')
df['Cabin_divide'] = df['Cabin'].str.split().map(divide_str)

In [95]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_part,Cabin_divide
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,c15,S,1,c 15
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,C 85